var rule = {
    author: '黑客',
    title: '中文AV',
    host: 'https://chineseav.org',
    url: '/search/fyclass/fypage/',
    searchUrl: '/search/**/fypage/',
    homeUrl: '/',
    searchable: 2,
    quickSearch: 0,
    filterable: 0,
    filter: '',
    filter_url: '',
    filter_def: {},
    headers: {
        'User-Agent': 'MOBILE_UA',
    },
    timeout: 5000,

    cate_exclude: '',
    play_parse: true,
    lazy: $js.toString(() => {
        input = {
            parse: 1,
            url: input,
            js: ''
        };
    }),
    double: false,
    推荐: '*',
    //数组、标题、图片、副标题、链接
    一级: '.listing-video;a&&title;img&&data-src|src;.pic-text&&Text;a&&href',
    二级: '*',

    搜索: '*',
    class_name: '玩偶姐姐&吴梦梦&潘甜甜&张津瑜&刘玥&孟若羽&沈娜娜&夏晴子&斑斑&林思妤&季妍希&闺蜜&李蓉蓉&坏坏&艾秋&金宝娜&温芮欣&秦可欣&苏语棠&凌薇&吴芳宜&莉娜&吴文淇&韩棠&乐奈子&李娜娜&雪千夏&娃娃&苏清歌&宋南伊&仙儿嫒&仙儿媛&柚子猫&玥可岚&管明美&徐蕾&蜜苏&尤莉&唐茜&苡若&白允儿&小敏儿&Nana&梁芸菲&香菱&优娜&白熙雨&楚梦舒&米欧&丝丝&寻小小&张芸熙&周宁&艾玛&小婕&艾熙&Cola酱&袁子仪&舒可芯&冉冉&姚宛儿&苏娅&宋雨川&林沁儿&白沛瑶&湘湘&NicoLove&小猫咪&白靖寒&小水水&唐雨菲&雪霏&苏念瑾&苏畅&钟宛冰&饼干姐姐&唐伯虎&雷梦娜&晨曦&桥本香菜&嘉洛&米菲兔&黎芷媗&樱花小猫&西门庆&顾桃桃&夏禹熙&黎儿&李允熙&明日香&许木学长&辛尤里&岚湘庭&晨晨&林凤娇&董悦悦&赖畇希&美酱&锅锅酱&橙子&玖玖&李薇薇&田伯光&南芊允&赵一曼&羽芮&白晶晶&林芊彤&师师&倪哇哇&鸡教练&李慕&吴茜茜&沈芯语&狐不妖&陆斑比&王以欣&兔兔&潘雨曦&安娜&不见星空&郭童童&陈可心&RONA&董小宛&白若冰&依涵&吴恺彤&悠悠&邓紫晴&奶咪酱&舒舒&唐霏&李文雯&何苗&苏璇&嘉琪&梁佳芯&静静&艾悠&菲菲&茉莉&御梦子&聂小倩&甜心宝贝&林可菲&吴心语&林怡梦&翁雨澄&STACY&宁静&心萱&桐桐&赵晓涵&白星雨&小夜夜&陈圆圆&樱樱&莫夕慈&多乙&鬼脚七&唐芯&绫波丽&花花&半雪&张宇芯&瑶瑶&尹志平&棉花糖糖&苏小小&莎莎&苏安亚&小二先生&樱井美里&唐可可&波妮&兮兮&美樱&爱丽丝&玲珑&雅沁&三月樱花&白葵司&苡琍&张欣妍&文冰冰&戚小怜&小冉&小遥&艾米酱&斯文禽兽&韩宝儿&淑怡&莉奈&MOMO&李依依&李曼妮&伊琬琳&瑶贝&紫萱&驯鹿女孩&宋东琳&雯茜&熙熙&徐夜夜&李琼&王玥&小捷&露露&卢珊珊&玛丽莲&苏艾文&肖云&艾鲤&宁洋子&昀希&二代CC&咪妮&牛奶泡芙&阿雅&程诗诗&罗瑾萱&安安&白思吟&米娅&chocoletmilkk&李恩娜&小洁&小桃酱&梅子&娜美&沙美辰&魏乔安&小仙女&杨思敏&米亚&萧悦儿&高梨遥香&虞姬&桶主任&白鹿&丽萨&星星&项子甯&妍儿&林妙可&林曼芸&林洋&杨柳&米娜学姐&美杜莎&茶理&妲己&极品哥&叶宸欣&安琪&柔伊&球球&古伊娜&琳达&吴凯彤&欣怡&许诺&钟丽琪&王茜&苹果&池田奈美&A天使爱&周晴晴&宋可&惠敏&晴天&杏吧老王&苏然&香月怜&陈美琳&浅尾美羽&阿水妹妹&俄罗斯女神&情深叉喔&丽娜&唐雨霏&香菜公主&苏文文&谢语彤&西子&林晓雪&羞羞兔&黄雪纯&DORY&七七&白童童&斯斯&凌萱&张雅婷&苏雨彤&觅嫣&陈美惠&乐淆雪&可儿&徐婕&杜鹃&石榴&舒涵&苏小新&费爵娜&陈小雨&胡蓉蓉&喵喵&肥尸哥&小麦&沈湘妮&陈星然&兰心洁&王筱璐&程葳&优优&陶子&向若云&娃诺&小月&涵涵&米胡桃&苗方&姚彤彤&吉吉&莫云雪&Chloe&月牙&苏小沫&琳怡&啤儿&童汐&李微微&苏旋&xx君&妖妖&小鹿酱&美嘉&董欣&宋妮可&白颖&穆雪&韩依人&林雪&清洛&北野爱&阿柒&憨憨&林玥玥&特污兔&雨晨&冬月结衣&宸荨樱桃&陆思涵&凌雨萱&宋甜甜&尤奈&岚可彤&洁咪&丁香&优雅&小影&恩恩&梦洁&花语柔&芽芽&赵雅琳&施子涵&万静雪&大奶露&波尼&余丽&口罩酱&咪咪&张曼青&朱莉&林襄&梁云菲&金铭&七濑恋&叶子红&夏宝&夏雨荷&奈奈子&张晴&林杏&维里娜&羽熙&许依然&井川里野&付妙菱&小昭&岚玥&王有容&黎芷萱&杜冰若&缃缃&菜菜&Vita&依颂&白瞳瞳&艾艾&金善雅&顾小北&夏天&小婵&桥本爱菜&潘甜甜&白川麻衣&真希波&金巧巧&林亦涵&王欣&璇元&紫宸&雪见&雯嘉&雪莉&艾瑞卡&可乐&伊婉琳&玥诗&洁米&陈韵&冯雪&徐筱欣&李丹彤&李可欣&清沐&秋霞&陆雪琪&陶杏儿&中野惠子&刘清韵&姜洁&曾强&柠檬&米砂&蔷薇&许书曼&韩小雅&兔小白&小宇&KIKI&都可可&欧美玲&张娅庭&小泽纱香&虎仔&张琪琪&灵枝&白婷婷&诗琪&乔乔&吉娜&夏露&多多&季研希&神谷怜&美竹铃&芯萱&芳情&范可可&蒋梦琳&蔡晓雨&丽丽&南兰&叶一涵&向若芸&姬咲华&娜宝&宇佐爱花&小乔&小爱&张婉妍&星谷瞳&李家葳&林雨露&璟雯&穆娜&胡心瑶&酥酥&陆子欣&黄雅曼&欲梦&ROXIE&榨汁姬&米兰&喵十四&叶梦语&真木今日子&周卿卿&yesyo&七月&苏念谨&凌葳&杨桃&梦珊&白溏&采缇&阿刚&吴文琪&咪妃&增田枫&妲已&宁灿儿&明儿&淳儿&王佩&白雪&程雨沫&米妃&艾莉&苏茜&莉莉&辰悦&韩小野&伊靖瑶&何小丽&小哇&小蜜&张妮妮&张子瑜&明步奈&木下日葵&李思思&李曼丽&李燕&梁如意&檀雅&洋洋&王小妮&王蓉&纪妍希&莫潇潇&陈小云&韩焉&颂潮&高小颜&朵儿&鸡蛋饼&柔柔&无双&百合&黄梦梦&小千绪&氖氖&蔚曼&刘颖儿&逢见梨花&简一&婷萝莉&小云云&刘小姗&喜儿&孤不妖&芝芝&蒙娜&陈书婷&姗彤&婉婷&婕珍&小美惠&希汶&张敏娜&紫寒&艾薇儿&萌恬恬&雪梨&中岛芳子&何安汝&佳欣&千凌&千鹤&吴语菲&唐月琴&夏夏&夏绯&小艾&张佳晨&张秀玲&弥生美月&徐艳&徐韵姗&林芳&水原圣子&沙耶香&深名美惠&潇洒哥&爱玲&玉面探花&甄可依&田恬&白潼潼&白英&羽月萌音&袁采菱&陈若瑶&丹丹&禾莉&韩倪希&茶茶&美凉子&董小婉&黑糖&闵闵&雅捷&Alice&糖糖儿&刘依依&云朵&甜心格格&小橘妹妹&王姿&白石麻衣&董月月&关玥婷&凯丽&前田由美&叶如梦&夏沫&子晴&小林纱织&小玩子&希瑶&敏敏&杜娟&林小樱&林语桐&梦岚&梦瑶&椿芽&楚留香&波波&清水&芯怡&芸溪&苏婧薇&苏宁儿&落落&许月珍&语伊&谢冰岚&路虎&邦妮&韩梦嫣&高瑶梨香&麻衣CC&刘小雯&宣萱&小琦&李乐乐&玥可蓝&薛梦琪&酒井爱&中条爱莉&千夜喵喵&小薇&赵佳美&LENA&刘思慧&吴芮瑜&林子涵&小艺&Tiger&云小朵&娅菲&李墓&白熙羽&秋元&BabyKitten&Emma&乔雨昕&书涵&伊东爱瑠&伊伊&余默&叶予曦&多莉&张群&思乐&晏殊&李灵儿&沙月芽衣&清妍&爱悠&王心悦&王程程&王美琪&珠珠&白小七&肥雪&阿青&乐雪淆&冯思玥&刘玥&刘素娅&可娜&唐倩&夕海&姚茜&姜北柠&孙缇娜&张小九&徐美娇&慕非非&朱珠&杨玉环&林晚琬&柯晓&沫诗婷&百川麻衣&程欣媛&穆嫣红&纱耶香&绮罗&绯里娜&美茹&胡婧文&苏亦昕&诚太郎&赵雅洁&韩清怡&杨沫&小雪&倪菀儿&晨沁&加奈学姐&戴拉拉&心雪&空空&孟羽君&张津瑜&清欢夫妻&腕儿&Nina&云裳&北明莎&嘉雯&小鱼儿&展舒&徐媛媛&心蓝&板栗&甄珠&白曈曈&程香&美橙&苏曼&苏蜜&郝甜&陆小凤&陈以萱&霜花&青玉&凌语&叶柔&周梦琪&周青韵&墨涵&夏玉玲&夏雪&孙语薇&季晓彤&小微&小文&小柒&张思琪&慕妍&李妍希&李萍&杨子&林晓熙&林笑笑&林蔓芸&柳青&桥本爱奈&森田佳奈&沈依秋&流川千穗&浅野美羽&海棠&王小思&秦梦可&立花美羽&艾咪&苏心瑜&苏梦&蓝歆悦&诺诺&谭苗苗&贝琳娜&金妍&韩伊人&黄灿&黛芬尼&樱空桃桃&Yua&天音美纱&小芳&林西萌&许安妮&李婧琪&宫泽蓝&冯思雨&方紫璐&柯柯&韩子妍&欧妮酱&Tigre&倪宛儿&刘嘉佳&小岛凉&小柔&推车哥&櫻櫻&艾丽丝&賴畇希&阿朱&卡瑞莎&吉原亚希&尤娜&张淑仪&早川夏美&星野未唯&晨希涵&李嘉歆&杨雪&林丽&江城&爱咪&王晶晶&相泽悠奈&罗娜&舒婷&青椒&韩诗雨&阿蛇姐姐&美竹玲&望月优奈&欧阳晶&Braylin Bailey&Kate Bloom&唐菲',
    class_url: '玩偶姐姐&吴梦梦&潘甜甜&张津瑜&刘玥&孟若羽&沈娜娜&夏晴子&斑斑&林思妤&季妍希&闺蜜&李蓉蓉&坏坏&艾秋&金宝娜&温芮欣&秦可欣&苏语棠&凌薇&吴芳宜&莉娜&吴文淇&韩棠&乐奈子&李娜娜&雪千夏&娃娃&苏清歌&宋南伊&仙儿嫒&仙儿媛&柚子猫&玥可岚&管明美&徐蕾&蜜苏&尤莉&唐茜&苡若&白允儿&小敏儿&Nana&梁芸菲&香菱&优娜&白熙雨&楚梦舒&米欧&丝丝&寻小小&张芸熙&周宁&艾玛&小婕&艾熙&Cola酱&袁子仪&舒可芯&冉冉&姚宛儿&苏娅&宋雨川&林沁儿&白沛瑶&湘湘&NicoLove&小猫咪&白靖寒&小水水&唐雨菲&雪霏&苏念瑾&苏畅&钟宛冰&饼干姐姐&唐伯虎&雷梦娜&晨曦&桥本香菜&嘉洛&米菲兔&黎芷媗&樱花小猫&西门庆&顾桃桃&夏禹熙&黎儿&李允熙&明日香&许木学长&辛尤里&岚湘庭&晨晨&林凤娇&董悦悦&赖畇希&美酱&锅锅酱&橙子&玖玖&李薇薇&田伯光&南芊允&赵一曼&羽芮&白晶晶&林芊彤&师师&倪哇哇&鸡教练&李慕&吴茜茜&沈芯语&狐不妖&陆斑比&王以欣&兔兔&潘雨曦&安娜&不见星空&郭童童&陈可心&RONA&董小宛&白若冰&依涵&吴恺彤&悠悠&邓紫晴&奶咪酱&舒舒&唐霏&李文雯&何苗&苏璇&嘉琪&梁佳芯&静静&艾悠&菲菲&茉莉&御梦子&聂小倩&甜心宝贝&林可菲&吴心语&林怡梦&翁雨澄&STACY&宁静&心萱&桐桐&赵晓涵&白星雨&小夜夜&陈圆圆&樱樱&莫夕慈&多乙&鬼脚七&唐芯&绫波丽&花花&半雪&张宇芯&瑶瑶&尹志平&棉花糖糖&苏小小&莎莎&苏安亚&小二先生&樱井美里&唐可可&波妮&兮兮&美樱&爱丽丝&玲珑&雅沁&三月樱花&白葵司&苡琍&张欣妍&文冰冰&戚小怜&小冉&小遥&艾米酱&斯文禽兽&韩宝儿&淑怡&莉奈&MOMO&李依依&李曼妮&伊琬琳&瑶贝&紫萱&驯鹿女孩&宋东琳&雯茜&熙熙&徐夜夜&李琼&王玥&小捷&露露&卢珊珊&玛丽莲&苏艾文&肖云&艾鲤&宁洋子&昀希&二代CC&咪妮&牛奶泡芙&阿雅&程诗诗&罗瑾萱&安安&白思吟&米娅&chocoletmilkk&李恩娜&小洁&小桃酱&梅子&娜美&沙美辰&魏乔安&小仙女&杨思敏&米亚&萧悦儿&高梨遥香&虞姬&桶主任&白鹿&丽萨&星星&项子甯&妍儿&林妙可&林曼芸&林洋&杨柳&米娜学姐&美杜莎&茶理&妲己&极品哥&叶宸欣&安琪&柔伊&球球&古伊娜&琳达&吴凯彤&欣怡&许诺&钟丽琪&王茜&苹果&池田奈美&A天使爱&周晴晴&宋可&惠敏&晴天&杏吧老王&苏然&香月怜&陈美琳&浅尾美羽&阿水妹妹&俄罗斯女神&情深叉喔&丽娜&唐雨霏&香菜公主&苏文文&谢语彤&西子&林晓雪&羞羞兔&黄雪纯&DORY&七七&白童童&斯斯&凌萱&张雅婷&苏雨彤&觅嫣&陈美惠&乐淆雪&可儿&徐婕&杜鹃&石榴&舒涵&苏小新&费爵娜&陈小雨&胡蓉蓉&喵喵&肥尸哥&小麦&沈湘妮&陈星然&兰心洁&王筱璐&程葳&优优&陶子&向若云&娃诺&小月&涵涵&米胡桃&苗方&姚彤彤&吉吉&莫云雪&Chloe&月牙&苏小沫&琳怡&啤儿&童汐&李微微&苏旋&xx君&妖妖&小鹿酱&美嘉&董欣&宋妮可&白颖&穆雪&韩依人&林雪&清洛&北野爱&阿柒&憨憨&林玥玥&特污兔&雨晨&冬月结衣&宸荨樱桃&陆思涵&凌雨萱&宋甜甜&尤奈&岚可彤&洁咪&丁香&优雅&小影&恩恩&梦洁&花语柔&芽芽&赵雅琳&施子涵&万静雪&大奶露&波尼&余丽&口罩酱&咪咪&张曼青&朱莉&林襄&梁云菲&金铭&七濑恋&叶子红&夏宝&夏雨荷&奈奈子&张晴&林杏&维里娜&羽熙&许依然&井川里野&付妙菱&小昭&岚玥&王有容&黎芷萱&杜冰若&缃缃&菜菜&Vita&依颂&白瞳瞳&艾艾&金善雅&顾小北&夏天&小婵&桥本爱菜&潘甜甜&白川麻衣&真希波&金巧巧&林亦涵&王欣&璇元&紫宸&雪见&雯嘉&雪莉&艾瑞卡&可乐&伊婉琳&玥诗&洁米&陈韵&冯雪&徐筱欣&李丹彤&李可欣&清沐&秋霞&陆雪琪&陶杏儿&中野惠子&刘清韵&姜洁&曾强&柠檬&米砂&蔷薇&许书曼&韩小雅&兔小白&小宇&KIKI&都可可&欧美玲&张娅庭&小泽纱香&虎仔&张琪琪&灵枝&白婷婷&诗琪&乔乔&吉娜&夏露&多多&季研希&神谷怜&美竹铃&芯萱&芳情&范可可&蒋梦琳&蔡晓雨&丽丽&南兰&叶一涵&向若芸&姬咲华&娜宝&宇佐爱花&小乔&小爱&张婉妍&星谷瞳&李家葳&林雨露&璟雯&穆娜&胡心瑶&酥酥&陆子欣&黄雅曼&欲梦&ROXIE&榨汁姬&米兰&喵十四&叶梦语&真木今日子&周卿卿&yesyo&七月&苏念谨&凌葳&杨桃&梦珊&白溏&采缇&阿刚&吴文琪&咪妃&增田枫&妲已&宁灿儿&明儿&淳儿&王佩&白雪&程雨沫&米妃&艾莉&苏茜&莉莉&辰悦&韩小野&伊靖瑶&何小丽&小哇&小蜜&张妮妮&张子瑜&明步奈&木下日葵&李思思&李曼丽&李燕&梁如意&檀雅&洋洋&王小妮&王蓉&纪妍希&莫潇潇&陈小云&韩焉&颂潮&高小颜&朵儿&鸡蛋饼&柔柔&无双&百合&黄梦梦&小千绪&氖氖&蔚曼&刘颖儿&逢见梨花&简一&婷萝莉&小云云&刘小姗&喜儿&孤不妖&芝芝&蒙娜&陈书婷&姗彤&婉婷&婕珍&小美惠&希汶&张敏娜&紫寒&艾薇儿&萌恬恬&雪梨&中岛芳子&何安汝&佳欣&千凌&千鹤&吴语菲&唐月琴&夏夏&夏绯&小艾&张佳晨&张秀玲&弥生美月&徐艳&徐韵姗&林芳&水原圣子&沙耶香&深名美惠&潇洒哥&爱玲&玉面探花&甄可依&田恬&白潼潼&白英&羽月萌音&袁采菱&陈若瑶&丹丹&禾莉&韩倪希&茶茶&美凉子&董小婉&黑糖&闵闵&雅捷&Alice&糖糖儿&刘依依&云朵&甜心格格&小橘妹妹&王姿&白石麻衣&董月月&关玥婷&凯丽&前田由美&叶如梦&夏沫&子晴&小林纱织&小玩子&希瑶&敏敏&杜娟&林小樱&林语桐&梦岚&梦瑶&椿芽&楚留香&波波&清水&芯怡&芸溪&苏婧薇&苏宁儿&落落&许月珍&语伊&谢冰岚&路虎&邦妮&韩梦嫣&高瑶梨香&麻衣CC&刘小雯&宣萱&小琦&李乐乐&玥可蓝&薛梦琪&酒井爱&中条爱莉&千夜喵喵&小薇&赵佳美&LENA&刘思慧&吴芮瑜&林子涵&小艺&Tiger&云小朵&娅菲&李墓&白熙羽&秋元&BabyKitten&Emma&乔雨昕&书涵&伊东爱瑠&伊伊&余默&叶予曦&多莉&张群&思乐&晏殊&李灵儿&沙月芽衣&清妍&爱悠&王心悦&王程程&王美琪&珠珠&白小七&肥雪&阿青&乐雪淆&冯思玥&刘玥&刘素娅&可娜&唐倩&夕海&姚茜&姜北柠&孙缇娜&张小九&徐美娇&慕非非&朱珠&杨玉环&林晚琬&柯晓&沫诗婷&百川麻衣&程欣媛&穆嫣红&纱耶香&绮罗&绯里娜&美茹&胡婧文&苏亦昕&诚太郎&赵雅洁&韩清怡&杨沫&小雪&倪菀儿&晨沁&加奈学姐&戴拉拉&心雪&空空&孟羽君&张津瑜&清欢夫妻&腕儿&Nina&云裳&北明莎&嘉雯&小鱼儿&展舒&徐媛媛&心蓝&板栗&甄珠&白曈曈&程香&美橙&苏曼&苏蜜&郝甜&陆小凤&陈以萱&霜花&青玉&凌语&叶柔&周梦琪&周青韵&墨涵&夏玉玲&夏雪&孙语薇&季晓彤&小微&小文&小柒&张思琪&慕妍&李妍希&李萍&杨子&林晓熙&林笑笑&林蔓芸&柳青&桥本爱奈&森田佳奈&沈依秋&流川千穗&浅野美羽&海棠&王小思&秦梦可&立花美羽&艾咪&苏心瑜&苏梦&蓝歆悦&诺诺&谭苗苗&贝琳娜&金妍&韩伊人&黄灿&黛芬尼&樱空桃桃&Yua&天音美纱&小芳&林西萌&许安妮&李婧琪&宫泽蓝&冯思雨&方紫璐&柯柯&韩子妍&欧妮酱&Tigre&倪宛儿&刘嘉佳&小岛凉&小柔&推车哥&櫻櫻&艾丽丝&賴畇希&阿朱&卡瑞莎&吉原亚希&尤娜&张淑仪&早川夏美&星野未唯&晨希涵&李嘉歆&杨雪&林丽&江城&爱咪&王晶晶&相泽悠奈&罗娜&舒婷&青椒&韩诗雨&阿蛇姐姐&美竹玲&望月优奈&欧阳晶&Braylin Bailey&Kate Bloom&唐菲',

}